tutorials/cylinder3D/cylinder/base/Allrun.run.parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runParallel -append $(getApplication)

#------------------------------------------------------------------------------
