tutorials/cylinder3D/cylinder/base/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
U
{
    boundaryField
    {
        jet
        {
            type            agentJet;
            deterministic   false;
            controlPeriod   0.25;
            rampUpPeriod    0.1;
            policyDir       "model";
            stateField      p;
            stateProbesNo   315;
            interpolationScheme cellPoint;
            stateProbeLocations nonuniform List<vector>
            315
            (
                ( 0.55000000 -1.25000000 -4.00000000 )
                ( 0.55000000 -1.25000000 -2.66666667 )
                ( 0.55000000 -1.25000000 -1.33333333 )
                ( 0.55000000 -1.25000000 0.00000000 )
                ( 0.55000000 -1.25000000 1.33333333 )
                ( 0.55000000 -1.25000000 2.66666667 )
                ( 0.55000000 -1.25000000 4.00000000 )
                ( 0.55000000 -0.62500000 -4.00000000 )
...
            );
            value           uniform (0 0 0);
        }
    }
}
// ************************************************************************* //
