tutorials/cylinder3D/cylinder/base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0;

deltaT          1e-2;

writeControl    runTime;

writeInterval   1;

purgeWrite      2;

writeFormat     binary;

writePrecision  10;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

libs            (DRLAgentTF);

functions
{
    #include funcObjForces;
    #include funcObjCompU;
    #include funcObjJet;
    #include funcObjProbes;
    // #include funcObjMidplane;
}

// ************************************************************************* //
