tutorials/cylinder3D/cylinder/base/system/funcObjJet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

jet
{
     type            surfaceFieldValue;
     libs            (fieldFunctionObjects);
     enabled         true;
     writeControl    timeStep;
     writeInterval   1;
     log             true;
     writeFields     false;
     regionType      patch;
     name            jet;
     operation       areaAverage;
     fields
     (
         Uy
     );
}