tutorials/cylinder3D/cylinder/base/system/funcObjMagU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

magU
{
    type            mag;
    libs            (fieldFunctionObjects);
    field           U;
    executeControl  timeStep;
    writeControl    writeTime;
}