tutorials/cylinder3D/cylinder/base/system/funcObjMidplane
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

midplane
{
    type            surfaces;
    libs            (sampling);
    executeControl  onEnd;
    writeControl    onEnd;
    fields          ( U );
    surfaceFormat   raw;
    store           true;
    interpolationScheme cell;
    surfaces
    {
        midPlane
        {
            type            plane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 0);
                normal  (0 0 1);

            }
            triangulate	    false;
            interpolate     false;
            enabled         true;
        }
    }   
}

