tutorials/cylinder3D/cylinder/base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-05;
        relTol           0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "pcorr.*"
    {
        $p
        tolerance       0.01;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    5;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    //consistent          yes;

    residualControl
    {
        "(U|p)"
        {
            relTol          0;
            tolerance       1e-04;
        }
    }
}

// relaxationFactors
// {
//     fields
//     {
//         p                          table ((0 0.9) (10 1));
//     }
//     equations
//     {
//         "(U|k|omega|nuTilda)"      table ((0 0.9) (10 1));
//         "(U|k|omega|nuTilda)Final" 1.0;
//     }
// }

// ************************************************************************* //
