tutorials/cylinder3D/cylinder/base/system/probes
( 0.55000000 -1.25000000 -4.00000000 )
( 0.55000000 -1.25000000 -2.66666667 )
( 0.55000000 -1.25000000 -1.33333333 )
( 0.55000000 -1.25000000 0.00000000 )
( 0.55000000 -1.25000000 1.33333333 )
( 0.55000000 -1.25000000 2.66666667 )
( 0.55000000 -1.25000000 4.00000000 )
( 0.55000000 -0.62500000 -4.00000000 )
( 0.55000000 -0.62500000 -2.66666667 )
( 0.55000000 -0.62500000 -1.33333333 )
( 0.55000000 -0.62500000 0.00000000 )
( 0.55000000 -0.62500000 1.33333333 )
( 0.55000000 -0.62500000 2.66666667 )
( 0.55000000 -0.62500000 4.00000000 )
( 0.55000000 0.00000000 -4.00000000 )
( 0.55000000 0.00000000 -2.66666667 )
( 0.55000000 0.00000000 -1.33333333 )
( 0.55000000 0.00000000 0.00000000 )
( 0.55000000 0.00000000 1.33333333 )
( 0.55000000 0.00000000 2.66666667 )
( 0.55000000 0.00000000 4.00000000 )
( 0.55000000 0.62500000 -4.00000000 )
( 0.55000000 0.62500000 -2.66666667 )
( 0.55000000 0.62500000 -1.33333333 )
( 0.55000000 0.62500000 0.00000000 )
( 0.55000000 0.62500000 1.33333333 )
( 0.55000000 0.62500000 2.66666667 )
( 0.55000000 0.62500000 4.00000000 )
( 0.55000000 1.25000000 -4.00000000 )
( 0.55000000 1.25000000 -2.66666667 )
( 0.55000000 1.25000000 -1.33333333 )
( 0.55000000 1.25000000 0.00000000 )
( 0.55000000 1.25000000 1.33333333 )
( 0.55000000 1.25000000 2.66666667 )
( 0.55000000 1.25000000 4.00000000 )
( 1.48125000 -1.25000000 -4.00000000 )
( 1.48125000 -1.25000000 -2.66666667 )
( 1.48125000 -1.25000000 -1.33333333 )
( 1.48125000 -1.25000000 0.00000000 )
( 1.48125000 -1.25000000 1.33333333 )
( 1.48125000 -1.25000000 2.66666667 )
( 1.48125000 -1.25000000 4.00000000 )
( 1.48125000 -0.62500000 -4.00000000 )
( 1.48125000 -0.62500000 -2.66666667 )
( 1.48125000 -0.62500000 -1.33333333 )
( 1.48125000 -0.62500000 0.00000000 )
( 1.48125000 -0.62500000 1.33333333 )
( 1.48125000 -0.62500000 2.66666667 )
( 1.48125000 -0.62500000 4.00000000 )
( 1.48125000 0.00000000 -4.00000000 )
( 1.48125000 0.00000000 -2.66666667 )
( 1.48125000 0.00000000 -1.33333333 )
( 1.48125000 0.00000000 0.00000000 )
( 1.48125000 0.00000000 1.33333333 )
( 1.48125000 0.00000000 2.66666667 )
( 1.48125000 0.00000000 4.00000000 )
( 1.48125000 0.62500000 -4.00000000 )
( 1.48125000 0.62500000 -2.66666667 )
( 1.48125000 0.62500000 -1.33333333 )
( 1.48125000 0.62500000 0.00000000 )
( 1.48125000 0.62500000 1.33333333 )
( 1.48125000 0.62500000 2.66666667 )
( 1.48125000 0.62500000 4.00000000 )
( 1.48125000 1.25000000 -4.00000000 )
( 1.48125000 1.25000000 -2.66666667 )
( 1.48125000 1.25000000 -1.33333333 )
( 1.48125000 1.25000000 0.00000000 )
( 1.48125000 1.25000000 1.33333333 )
( 1.48125000 1.25000000 2.66666667 )
( 1.48125000 1.25000000 4.00000000 )
( 2.41250000 -1.25000000 -4.00000000 )
( 2.41250000 -1.25000000 -2.66666667 )
( 2.41250000 -1.25000000 -1.33333333 )
( 2.41250000 -1.25000000 0.00000000 )
( 2.41250000 -1.25000000 1.33333333 )
( 2.41250000 -1.25000000 2.66666667 )
( 2.41250000 -1.25000000 4.00000000 )
( 2.41250000 -0.62500000 -4.00000000 )
( 2.41250000 -0.62500000 -2.66666667 )
( 2.41250000 -0.62500000 -1.33333333 )
( 2.41250000 -0.62500000 0.00000000 )
( 2.41250000 -0.62500000 1.33333333 )
( 2.41250000 -0.62500000 2.66666667 )
( 2.41250000 -0.62500000 4.00000000 )
( 2.41250000 0.00000000 -4.00000000 )
( 2.41250000 0.00000000 -2.66666667 )
( 2.41250000 0.00000000 -1.33333333 )
( 2.41250000 0.00000000 0.00000000 )
( 2.41250000 0.00000000 1.33333333 )
( 2.41250000 0.00000000 2.66666667 )
( 2.41250000 0.00000000 4.00000000 )
( 2.41250000 0.62500000 -4.00000000 )
( 2.41250000 0.62500000 -2.66666667 )
( 2.41250000 0.62500000 -1.33333333 )
( 2.41250000 0.62500000 0.00000000 )
( 2.41250000 0.62500000 1.33333333 )
( 2.41250000 0.62500000 2.66666667 )
( 2.41250000 0.62500000 4.00000000 )
( 2.41250000 1.25000000 -4.00000000 )
( 2.41250000 1.25000000 -2.66666667 )
...
( 8.00000000 1.25000000 4.00000000 )
